# Dataframes Part 2

In [14]:
import numpy as np
import pandas as pd

In [15]:
from numpy.random import randn

In [16]:
np.random.seed(101)

In [19]:
np.arange(0,20).reshape(5,4)

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19]])

In [106]:
df=pd.DataFrame(np.arange(0,20).reshape(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [107]:
df

    W   X   Y   Z
A   0   1   2   3
B   4   5   6   7
C   8   9  10  11
D  12  13  14  15
E  16  17  18  19

In [51]:
df.loc[:,'W']

A     0
B     4
C     8
D    12
E    16
Name: W, dtype: int32

# Conditional Selection

In [193]:
df=pd.DataFrame(np.arange(0,20).reshape(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [194]:
df

    W   X   Y   Z
A   0   1   2   3
B   4   5   6   7
C   8   9  10  11
D  12  13  14  15
E  16  17  18  19

In [195]:
df > 5

       W      X      Y      Z
A  False  False  False  False
B  False  False   True   True
C   True   True   True   True
D   True   True   True   True
E   True   True   True   True

In [196]:
booldf = df > 5

In [197]:
booldf

       W      X      Y      Z
A  False  False  False  False
B  False  False   True   True
C   True   True   True   True
D   True   True   True   True
E   True   True   True   True

In [198]:
df[booldf]

      W     X     Y     Z
A   NaN   NaN   NaN   NaN
B   NaN   NaN   6.0   7.0
C   8.0   9.0  10.0  11.0
D  12.0  13.0  14.0  15.0
E  16.0  17.0  18.0  19.0

In [199]:
df[df > 5]

      W     X     Y     Z
A   NaN   NaN   NaN   NaN
B   NaN   NaN   6.0   7.0
C   8.0   9.0  10.0  11.0
D  12.0  13.0  14.0  15.0
E  16.0  17.0  18.0  19.0

In [200]:
df['W']

A     0
B     4
C     8
D    12
E    16
Name: W, dtype: int32

In [201]:
df['W'] > 5

A    False
B    False
C     True
D     True
E     True
Name: W, dtype: bool

In [202]:
df[df['W'] > 5]

    W   X   Y   Z
C   8   9  10  11
D  12  13  14  15
E  16  17  18  19

In [203]:
resulrtdf=df[df['W'] > 5]

In [204]:
resulrtdf

    W   X   Y   Z
C   8   9  10  11
D  12  13  14  15
E  16  17  18  19

In [205]:
resulrtdf['W']

C     8
D    12
E    16
Name: W, dtype: int32

In [206]:
df[df['W'] > 5]['W']  # Above two lines in one statement

C     8
D    12
E    16
Name: W, dtype: int32

In [207]:
df[df['W'] > 5][['W','X']]  # select multiple column

    W   X
C   8   9
D  12  13
E  16  17

In [208]:
df

    W   X   Y   Z
A   0   1   2   3
B   4   5   6   7
C   8   9  10  11
D  12  13  14  15
E  16  17  18  19

## Multiple conditions

In [209]:
df=pd.DataFrame(np.arange(0,20).reshape(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [210]:
df

    W   X   Y   Z
A   0   1   2   3
B   4   5   6   7
C   8   9  10  11
D  12  13  14  15
E  16  17  18  19

In [211]:
df['X']>10

A    False
B    False
C    False
D     True
E     True
Name: X, dtype: bool

In [212]:
df['Y']>14

A    False
B    False
C    False
D    False
E     True
Name: Y, dtype: bool

In [213]:
df[(df['X']>10) & (df['Y']>14)]   # And Opration

    W   X   Y   Z
E  16  17  18  19

In [214]:
df[(df['X']>10) | (df['Y']>14)]  #OR operation

    W   X   Y   Z
D  12  13  14  15
E  16  17  18  19

In [215]:
df[(df['X']>10) | (df['Y']>14)]['W']

D    12
E    16
Name: W, dtype: int32

# Index

### reset and Set index

In [216]:
df=pd.DataFrame(np.arange(0,20).reshape(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [217]:
df

    W   X   Y   Z
A   0   1   2   3
B   4   5   6   7
C   8   9  10  11
D  12  13  14  15
E  16  17  18  19

In [218]:
df.reset_index()   # TO Reset Index

  index   W   X   Y   Z
0     A   0   1   2   3
1     B   4   5   6   7
2     C   8   9  10  11
3     D  12  13  14  15
4     E  16  17  18  19

In [219]:
df

    W   X   Y   Z
A   0   1   2   3
B   4   5   6   7
C   8   9  10  11
D  12  13  14  15
E  16  17  18  19

In [238]:
df.reset_index(inplace=True)   # TO Reset Index peramantly

In [241]:
df

  index   W   X   Y   Z State
0     A   0   1   2   3    MH
1     B   4   5   6   7    MP
2     C   8   9  10  11    GJ
3     D  12  13  14  15    AP
4     E  16  17  18  19    KA

In [242]:
'MH MP GJ AP KA'.split()   # Spilt function og python

['MH', 'MP', 'GJ', 'AP', 'KA']

In [243]:
newindex='MH MP GJ AP KA'.split()

In [244]:
newindex

['MH', 'MP', 'GJ', 'AP', 'KA']

In [245]:
df['State']=newindex   #Addition of column

In [246]:
df

  index   W   X   Y   Z State
0     A   0   1   2   3    MH
1     B   4   5   6   7    MP
2     C   8   9  10  11    GJ
3     D  12  13  14  15    AP
4     E  16  17  18  19    KA

In [247]:
df.set_index('State')   # To Set Index, use inplace to permantly adding Index

      index   W   X   Y   Z
State
MH        A   0   1   2   3
MP        B   4   5   6   7
GJ        C   8   9  10  11
AP        D  12  13  14  15
KA        E  16  17  18  19

In [248]:
df

  index   W   X   Y   Z State
0     A   0   1   2   3    MH
1     B   4   5   6   7    MP
2     C   8   9  10  11    GJ
3     D  12  13  14  15    AP
4     E  16  17  18  19    KA

In [251]:
df.drop(labels='index', axis=1)  # to drop column

    W   X   Y   Z State
0   0   1   2   3    MH
1   4   5   6   7    MP
2   8   9  10  11    GJ
3  12  13  14  15    AP
4  16  17  18  19    KA